---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctInsulation
source: html/51664daf-0eb7-b39c-6c81-1b29e55b9ffd.htm
---
# DuctInsulation Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.